avr-rust/avrd/packs/atmega/AT90PWM1.atdf
        <register caption="PSC 1 Input B Control" name="PFRC1A" offset="0xEC" size="1">
          <bitfield caption="PSC 1 Capture Enable Input Part A" mask="0x80" name="PCAE1A"/>
          <bitfield caption="PSC 1 Input Select for Part A" mask="0x40" name="PISEL1A"/>
          <bitfield caption="PSC 1 Edge Level Selector on Input Part A" mask="0x20" name="PELEV1A"/>
          <bitfield caption="PSC 1 Filter Enable on Input Part A" mask="0x10" name="PFLTE1A"/>
          <bitfield caption="PSC 1 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM1A" values="PSC_FAULT_MODE_OPER"/>
        </register>
        <register caption="PSC 1 Control Register" name="PCTL1" offset="0xEB" size="1">
          <bitfield caption="PSC 1 Prescaler Selects" mask="0xC0" name="PPRE1" values="PSC_PRESCALER"/>
          <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM1"/>
          <bitfield caption="PSC 1 Asynchronous Output Control B" mask="0x10" name="PAOC1B"/>
          <bitfield caption="PSC 1 Asynchronous Output Control A" mask="0x08" name="PAOC1A"/>
          <bitfield caption="PSC1 Auto Run" mask="0x04" name="PARUN1"/>
          <bitfield caption="PSC1 Complete Cycle" mask="0x02" name="PCCYC1"/>
          <bitfield caption="PSC 1 Run" mask="0x01" name="PRUN1"/>
        </register>
        <register caption="PSC1 Synchro and Output Configuration" name="PSOC1" offset="0xE0" size="1">
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC1" values="PSC_SYNC_SOURCE"/>
          <bitfield caption="PSCOUT11 Output Enable" mask="0x04" name="POEN1B"/>
          <bitfield caption="PSCOUT10 Output Enable" mask="0x01" name="POEN1A"/>
        </register>
      </register-group>
      <value-group caption="" name="PSC_FAULT_MODE_OPER">
        <value caption="No action, PSC Input is ignored" name="VAL_0x00" value="0x00"/>
        <value caption="Stop signal, Jump to Opposite Dead-Time and Wait" name="VAL_0x01" value="0x01"/>
        <value caption="Stop signal, Execute Opposite Dead-Time and Wait" name="VAL_0x02" value="0x02"/>
        <value caption="Stop signal, Execute Opposite while Fault active" name="VAL_0x03" value="0x03"/>
        <value caption="Deactivate outputs without changing timing." name="VAL_0x04" value="0x04"/>
        <value caption="Stop signal and Insert Dead-Time" name="VAL_0x05" value="0x05"/>
        <value caption="Stop signal, Jump to Opposite Dead-Time and Wait." name="VAL_0x06" value="0x06"/>
        <value caption="Halt PSC and Wait for Software Action" name="VAL_0x07" value="0x07"/>
        <value caption="Edge Retrigger PSC" name="VAL_0x08" value="0x08"/>
        <value caption="Fixed Frequency Edge Retrigger PSC" name="VAL_0x09" value="0x09"/>
        <value caption="Reserved (do not use)" name="VAL_0x0A" value="0x0A"/>
        <value caption="Reserved (do not use)" name="VAL_0x0B" value="0x0B"/>
        <value caption="Reserved (do not use)" name="VAL_0x0C" value="0x0C"/>
        <value caption="Reserved (do not use)" name="VAL_0x0D" value="0x0D"/>
        <value caption="Fixed Frequency Edge Retrigger PSC and Disactivate Output" name="VAL_0x0E" value="0x0E"/>
        <value caption="Reserved (do not use)" name="VAL_0x0F" value="0x0F"/>
      </value-group>
      <value-group caption="" name="PSC_PRESCALER">
        <value caption="No divider on PSC input clock" name="VAL_0x00" value="0x00"/>
        <value caption="Divide the PSC input clock by 4" name="VAL_0x01" value="0x01"/>
        <value caption="Divide the PSC input clock by 16" name="VAL_0x02" value="0x02"/>
        <value caption="Divide the PSC input clock by 64" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="PSC_ALIGN_MODE">
        <value caption="One Ramp Mode" name="VAL_0x00" value="0x00"/>
        <value caption="Two Ramp Mode" name="VAL_0x01" value="0x01"/>
        <value caption="Four Ramp Mode" name="VAL_0x02" value="0x02"/>
        <value caption="Center Aligned Mode" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="PSC_SYNC_SOURCE">
        <value caption="Send signal on leading edge of PSCOUTn0" name="VAL_0x00" value="0x00"/>
        <value caption="Send signal on trailing edge of PSCOUTn0" name="VAL_0x01" value="0x01"/>
        <value caption="Send signal on leading edge of PSCOUTn1" name="VAL_0x02" value="0x02"/>
        <value caption="Send signal on trailing edge of PSCOUTn1" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="MISC_2BIT_COUNT">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="3" name="VAL_0x02" value="0x02"/>
        <value caption="4" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="SPI Pin Select" mask="0x80" name="SPIPS"/>
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
